Autodesk.Revit.DB.FaceIntersectionFaceResult
An enumerated type listing the possible results of a face-face intersection calculation.

Autodesk.Revit.DB.FaceIntersectionFaceResult.NonIntersecting
The two faces have no intersection.

Autodesk.Revit.DB.FaceIntersectionFaceResult.Intersecting
The two faces have an intersection.